; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v11)
             (pred_5 ?v1 ?v2)
             (pred_9 ?v4 ?v2)
             (pred_7 ?v6 ?v4 )
	     (pred_11 ?v4)
             (pred_12 ?v7)
             (pred_6 ?v1)
             (pred_4 ?v2)
             (pred_8 ?v4)
             (pred_2 ?v1)
             (pred_1 ?v4)
             (pred_3 ))



(:action op_4
:parameters (?v13 ?v9 ?v3 ?v5)
:precondition (and (pred_12 ?v13) (pred_12 ?v9) (pred_6 ?v3) (pred_4 ?v5)
          (pred_10 ?v13 ?v9) (pred_5 ?v3 ?v5)
                   (pred_9 ?v9 ?v5) (pred_11 ?v13) 
                   (pred_8 ?v9) (pred_2 ?v3))
:effect (and  (pred_1 ?v9) (not (pred_8 ?v9))))


(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_12 ?v13) (pred_12 ?v8)
               (pred_11 ?v13) (pred_10 ?v13 ?v8) (pred_1 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v13))))

(:action op_2
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_6 ?v3) 
                  (pred_11 ?v13) (pred_7 ?v3 ?v13) (pred_3 ))
:effect (and (pred_2 ?v3)
   (not (pred_7 ?v3 ?v13)) (not (pred_3 ))))


(:action op_1
:parameters (?v13 ?v10 ?v12)
:precondition (and (pred_12 ?v13) (pred_6 ?v10) (pred_6 ?v12)
                  (pred_11 ?v13) (pred_2 ?v12) (pred_7 ?v10 ?v13))
:effect (and (pred_2 ?v10) (pred_7 ?v12 ?v13)
        (not (pred_2 ?v12)) (not (pred_7 ?v10 ?v13))))

(:action op_5
:parameters (?v13 ?v3)
:precondition (and (pred_12 ?v13) (pred_6 ?v3) 
                  (pred_11 ?v13) (pred_2 ?v3))
:effect (and (pred_3 ) (pred_7 ?v3 ?v13) (not (pred_2 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_16 obj_01 obj_14 obj_12 obj_18 obj_08 obj_17 obj_11 obj_15 obj_20 obj_07 obj_06 obj_04 obj_09 obj_02
    obj_10 obj_03
    obj_19 obj_05
    )

    (:init
       (pred_3)

       (pred_12 obj_13)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_12)
       (pred_12 obj_18)
       (pred_12 obj_08)
       (pred_12 obj_17)
       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_02)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_6 obj_19)
       (pred_6 obj_05)

       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_16)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_16 obj_01)
       (pred_10 obj_16 obj_13)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_18)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_15 obj_04)
       (pred_10 obj_15 obj_20)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_15)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_15)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_09 obj_02)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_15)
       (pred_9  obj_13 obj_10)
       (pred_9  obj_15 obj_03)
       (pred_1 obj_16)
       (pred_1 obj_01)
       (pred_1 obj_14)
       (pred_1 obj_12)
       (pred_1 obj_18)
       (pred_1 obj_08)
       (pred_1 obj_17)
       (pred_1 obj_11)
       (pred_1 obj_20)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_02)

       (pred_5  obj_19 obj_10)
       (pred_5  obj_05 obj_03)
       (pred_7 obj_19 obj_02)
       (pred_7 obj_05 obj_17)
       (pred_11 obj_09)
    )

    (:goal (and
       (pred_7 obj_19 obj_06)
       (pred_7 obj_05 obj_11)
    ))
(:constraints
  (always (not (pred_11 obj_18)))
)
)

; plan
1. (op_3 obj_09 obj_02)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_02)
   goals met: 0 of 2
2. (op_2 obj_02 obj_19)
   deleted: (pred_7 obj_19 obj_02) (pred_3)
   added: (pred_2 obj_19)
   goals met: 0 of 2
3. (op_3 obj_02 obj_09)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_09)
   goals met: 0 of 2
4. (op_3 obj_09 obj_04)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_04)
   goals met: 0 of 2
5. (op_3 obj_04 obj_06)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_06)
   goals met: 0 of 2
6. (op_5 obj_06 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_3) (pred_7 obj_19 obj_06)
   goals met: 1 of 2
7. (op_3 obj_06 obj_04)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_04)
   goals met: 1 of 2
8. (op_3 obj_04 obj_09)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_09)
   goals met: 1 of 2
9. (op_3 obj_09 obj_20)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_20)
   goals met: 1 of 2
10. (op_3 obj_20 obj_08)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_08)
   goals met: 1 of 2
11. (op_3 obj_08 obj_17)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_17)
   goals met: 1 of 2
12. (op_2 obj_17 obj_05)
   deleted: (pred_7 obj_05 obj_17) (pred_3)
   added: (pred_2 obj_05)
   goals met: 1 of 2
13. (op_3 obj_17 obj_08)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_08)
   goals met: 1 of 2
14. (op_3 obj_08 obj_20)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_20)
   goals met: 1 of 2
15. (op_4 obj_20 obj_15 obj_05 obj_03)
   deleted: (pred_8 obj_15)
   added: (pred_1 obj_15)
   goals met: 1 of 2
16. (op_3 obj_20 obj_15)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_15)
   goals met: 1 of 2
17. (op_3 obj_15 obj_11)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_11)
   goals met: 1 of 2
18. (op_5 obj_11 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_3) (pred_7 obj_05 obj_11)
   goals met: 2 of 2
